In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

[]

In [2]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [5, 6, 7, 8]})

In [3]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [4]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [5]:
df1.merge(df2,left_on='lkey',right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [6]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo','abc'],
                     'value': [1, 2, 3, 5,6]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                     'value': [5, 6, 7, 8]})

In [7]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  abc      6

In [8]:
df1.merge(df2,left_on='lkey',right_on='rkey',how='outer')  #so only key values which is present in both dataframes is used

  lkey  value_x rkey  value_y
0  foo        1  foo      5.0
1  foo        1  foo      8.0
2  foo        5  foo      5.0
3  foo        5  foo      8.0
4  bar        2  bar      6.0
5  baz        3  baz      7.0
6  abc        6  NaN      NaN

In [9]:
df1.merge(df2,left_on='lkey',right_on='rkey',how='inner')   # sort of like sets intersection in maths

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [10]:
df1.merge(df2,left_on='lkey',right_on='rkey')  #default is intersection in how

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [11]:
# left_on gonna take index value of left column for left dataframe to decide for merging
# right_on gonna take index value of right column for right dataframe

In [12]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo','abc'],
                     'value': [1, 2, 3, 5,6]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo','efg'],
                     'value': [5, 6, 7, 8,11]})

In [13]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
4  abc      6

In [14]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8
4  efg     11

In [15]:
df1.merge(df2,left_on='lkey',right_on='rkey',how='left')
# can be used to exract features from right dataframe and not extra features in right dataframe in left and merge them

  lkey  value_x rkey  value_y
0  foo        1  foo      5.0
1  foo        1  foo      8.0
2  bar        2  bar      6.0
3  baz        3  baz      7.0
4  foo        5  foo      5.0
5  foo        5  foo      8.0
6  abc        6  NaN      NaN

In [16]:
df1.merge(df2,left_on='lkey',right_on='rkey',how='right')

  lkey  value_x rkey  value_y
0  foo      1.0  foo        5
1  foo      5.0  foo        5
2  foo      1.0  foo        8
3  foo      5.0  foo        8
4  bar      2.0  bar        6
5  baz      3.0  baz        7
6  NaN      NaN  efg       11

In [17]:
# If we use on then it has to be present in both dataframes